---
type: MEPBuildingConstructionSet
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 10
tags: [revit-api, class]
---

# MEPBuildingConstructionSet

`Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPBuildingConstructionSet | — | `public MEPBuildingConstructionSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( MEPBuildingConstruction item )` |
| Method | Erase | — | `public virtual int Erase ( MEPBuildingConstruction item )` |
| Method | ForwardIterator | — | `public virtual MEPBuildingConstructionSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( MEPBuildingConstruction item )` |
| Method | ReverseIterator | — | `public virtual MEPBuildingConstructionSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |